src/app/Models/CommentModel.php

SELECT *
FROM `comment`
WHERE `comment`.`deleted_at` IS NULL
SELECT *
FROM `comment`
WHERE `id` = '7'
AND `comment`.`deleted_at` IS NULL
 LIMIT 1
---
    public function getComments($id = false)
    {
        if ($id === false) {
            return $this->findAll();
        }

        return $this->where(['id' => $id])->first();